# Pandas

![](http://pandas.pydata.org/_static/pandas_logo.png)
[Pandas](http://pandas.pydata.org/) is a software library written for the Python programming language for data manipulation and analysis. In particular, **it offers data structures and operations for manipulating numerical tables and time series.** Pandas is free software released under the three-clause BSD license. The name is derived from the term _panel data_, an econometrics term for multidimensional structured data sets.

#### Contents
* [Importing Pandas](#Importing-Pandas) and other libraries.
* [Creating Data](#Creating-Data) using lists and tuples
* [Viewing Data](#Viewing-Data)
* [Saving Data](#Saving-Data) to_csv and to_excel
* [Loading Data](#Loading-Data) read_csv, read_table read_excel, read_html
    * [Unix and os](#Unix-and-os)
    * [csvs and Excel](#CSVs-and-Excel)
* [Selecting Data](#Selecting-Data) loc,iloc,isin
    * [Masks](#Masks) or boolean arrays


NB: This notebook misses some methods of joining and concatenating and merging data. The instances in which those are useful are quite specific, so we'll see some examples but won't have a section in this notebook for reference. 

#### Resources:  
* [Pandas Documentation](http://pandas.pydata.org/pandas-docs/stable/index.html), especially
[10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)  
* [The Data Incubator](https://www.thedataincubator.com/)  
* [Hernan Rojas' learn-pandas](https://bitbucket.org/hrojas/learn-pandas)  
* [Harvard CS109 lab1 content](https://github.com/cs109/2015lab1)

## Importing Pandas

The general way to import libraries is to write
```python
import library #import the library directly
import library as alias 

# This just aliases the package names.
# That way we can call methods like plt.plot() instead of matplotlib.pyplot.plot().

from library import function # import specific functions or types in a library
%jupyter magic # jupyter only functions
```

In [1]:
# Some imports - for style reasons, try and put in alphabetical order, unless there are subgroupings of imports
# that you want.
import matplotlib #we'll only use this to determine the matplotlib version number
import matplotlib.pyplot as plt  # the graphing library
import numpy as np # scientific computing library
import pandas as pd # the data structure and analysis library
from pandas import DataFrame, read_csv, Series # specific functions from pandas
import seaborn as sns # Makes graphs look pretty
import sys #we'll only use this to determine the python version number

# Enable inline plotting.  The % is an iPython thing, and is not part of the Python language.
# In this case we're just telling the plotting library to draw things on
# the notebook, instead of on a separate window.
%matplotlib inline

In [2]:
d = pd.DataFrame({'A' : [1,2,3],
                  'B' : [1,2,3]})
d.index = ['I','II','III']
d

     A  B
I    1  1
II   2  2
III  3  3

In [3]:
# All the imports are listed as modules, including pyplot.  But there are several other types
%whos

Variable     Type         Data/Info
-----------------------------------
DataFrame    type         <class 'pandas.core.frame.DataFrame'>
Series       type         <class 'pandas.core.series.Series'>
d            DataFrame         A  B\nI    1  1\nII   2  2\nIII  3  3
matplotlib   module       <module 'matplotlib' from<...>/matplotlib/__init__.py'>
np           module       <module 'numpy' from '/op<...>kages/numpy/__init__.py'>
pd           module       <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
plt          module       <module 'matplotlib.pyplo<...>es/matplotlib/pyplot.py'>
read_csv     function     <function read_csv at 0x7f936bf245e0>
sns          module       <module 'seaborn' from '/<...>ges/seaborn/__init__.py'>
sys          module       <module 'sys' (built-in)>

In [4]:
# How to check your version numbers
print(('Python version: ' + sys.version))
print() 
print(('Pandas version: ' + pd.__version__))
print(('Matplotlib version: ' + matplotlib.__version__))

Python version: 3.9.7 (default, Sep 16 2021, 08:50:36)
[Clang 10.0.0 ]

Pandas version: 1.3.4
Matplotlib version: 3.4.3

## Creating Data

There are many ways to input data into Pandas. The goal of this is to input data to DataFrames.

In [5]:
# A data frame, using a dictionary with ordered 
# lists for columns

df1 = pd.DataFrame({
    'number': [1, 2, 3],
    'animal': ['cat', 'dog', 'mouse']
})

# The same data frame, using tuples for each row
# We need to give the column names separately!
df2 = pd.DataFrame([
    ('cat', 1),
    ('dog', 2),
    ('mouse', 3),
], columns=['animal','number'])

# Are they the same? # No
# assert((df1 == df2).all().all)

df3 = pd.DataFrame([
    (1,'cat'),
    (2,'dog'),
    (3,'mouse'),
],columns=['number','animal'])

# Are they the same? # Yes
assert((df1 == df3).all().all)

display(df1)
display(df2)
display(df3)

print((df1==df3).all()) # By column check
print((df1==df3).all().all()) # All

   number animal
0       1    cat
1       2    dog
2       3  mouse

  animal  number
0    cat       1
1    dog       2
2  mouse       3

   number animal
0       1    cat
1       2    dog
2       3  mouse

number    True
animal    True
dtype: bool
True

In [6]:
dates = pd.date_range('20161101',periods =6)
dates

DatetimeIndex(['2016-11-01', '2016-11-02', '2016-11-03', '2016-11-04',
               '2016-11-05', '2016-11-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df3 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df3

                   A         B         C         D
2016-11-01  0.659059 -1.635351  2.096311  0.265615
2016-11-02 -0.497848  0.758721  0.737929  0.074273
2016-11-03  0.195325  2.265315  0.695710 -0.061794
2016-11-04 -0.162846  0.526822  0.190351  2.254721
2016-11-05  0.159479  2.183735  0.644436 -0.308660
2016-11-06  0.689278 -1.920063 -0.382905 -0.480844

Let's Create another DataFrame, with different data types.  
Side note that that you can copy examples from the internet 
like this into Jupyter Notebooks, it still works, but only if there isn't anything else in the cell!

From: http://pandas.pydata.org/pandas-docs/stable/10min.html

In [8]:
In [10]: df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
   ....: 

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
# Dataframe Columns have specific data types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

Selecting a single column, which yields a Series.

A Series, like a numpy array, most be of homogenous type

In [10]:
# Like Dictionaries! DataFrame is a dictionary of Series!
# The rows are vectors with different dtypes. But columns are serieses, which have same dtype in each one of them.
df1['animal']

0      cat
1      dog
2    mouse
Name: animal, dtype: object

In [11]:
# Access a column as a property of df1
df1.animal
# [[]] will make it as a df

0      cat
1      dog
2    mouse
Name: animal, dtype: object

In [12]:
# Selecting rows
df3[3:5]

                   A         B         C         D
2016-11-04 -0.162846  0.526822  0.190351  2.254721
2016-11-05  0.159479  2.183735  0.644436 -0.308660

## Exercise

In [13]:
# Select all the data from columns of C and D of df3
df3.loc[:,['C','D']]
df3[['C','D']]
df3.iloc[:,2:4]

                   C         D
2016-11-01  2.096311  0.265615
2016-11-02  0.737929  0.074273
2016-11-03  0.695710 -0.061794
2016-11-04  0.190351  2.254721
2016-11-05  0.644436 -0.308660
2016-11-06 -0.382905 -0.480844

## Saving Data

#### Exporting to CSVs and Excel files

Export the our df to a ***csv*** file. We can name the file ***malaysia_states.csv***, but we can also do a txt file! The function ***to_csv*** will be used to export the file. The file will be saved in the same location of the notebook unless specified otherwise.

In [14]:
states = ['Johor','Kedah','Kelantan','Melaka', 
          'Negeri Sembilan','Pahang','Perak','Perlis',
          'Penang','Sabah', 'Sarawak','Selangor','Terengganu']
area = [19210,9500,15099,1664,6686,36137,21035,
        821,1048,73631,124450,8104,13035]
state_area = list(zip(states, area))
state_area
df = pd.DataFrame(data = state_area, columns=['State', 'Area'])

In [15]:
df_2method = pd.DataFrame({
    'State': states,
    'Area': area
})
df_2method

              State    Area
0             Johor   19210
1             Kedah    9500
2          Kelantan   15099
3            Melaka    1664
4   Negeri Sembilan    6686
5            Pahang   36137
6             Perak   21035
7            Perlis     821
8            Penang    1048
9             Sabah   73631
10          Sarawak  124450
11         Selangor    8104
12       Terengganu   13035

In [16]:
(df == df_2method).all() # identical dfs

State    True
Area     True
dtype: bool

In [17]:
df.to_csv?

The only parameters we will use is ***index*** and ***header***. Setting these parameters to True will prevent the index and header names from being exported. Change the values of these parameters to get a better understanding of their use.

In [18]:
df.to_csv('malaysia_states.csv',index=False,header=False)

In [19]:
# Let's also try a text file
# CSV actually stands for comma separated values.
df.to_csv('malaysia_states.txt',index=False,header=False)

In [20]:
df.to_excel?

In [21]:
# And to Excel files
df.to_excel('malaysia_states.xlsx',index=False)

In [22]:
# Reset our namespace; delete all variables
# %reset

In [23]:
%whos

Variable     Type             Data/Info
---------------------------------------
DataFrame    type             <class 'pandas.core.frame.DataFrame'>
Series       type             <class 'pandas.core.series.Series'>
area         list             n=13
d            DataFrame             A  B\nI    1  1\nII   2  2\nIII  3  3
dates        DatetimeIndex    DatetimeIndex(['2016-11-0<...>atetime64[ns]', freq='D')
df           DataFrame                      State    Ar<...>       Terengganu   13035
df1          DataFrame           number animal\n0      <...>    dog\n2       3  mouse
df2          DataFrame             A          B    C  D<...>01-02  1.0  3  train  foo
df3          DataFrame                           A     <...>20063 -0.382905 -0.480844
df_2method   DataFrame                      State    Ar<...>       Terengganu   13035
matplotlib   module           <module 'matplotlib' from<...>/matplotlib/__init__.py'>
np           module           <module 'numpy' from '/op<...>kages/numpy/__init__.py'>
pd           module           <module 'pandas' from '/o<...>ages/pandas/__init__.py'>
plt          module           <module 'matplotlib.pyplo<...>es/matplotlib/pyplot.py'>
read_csv     function         <function read_csv at 0x7f936bf245e0>
sns          module           <module 'seaborn' from '/<...>ges/seaborn/__init__.py'>
state_area   list             n=13
states       list             n=13
sys          module           <module 'sys' (built-in)>

## Loading Data

Let's now try accessing that csv that we just saved.  Let us take a look at this function and what inputs it takes.

In [24]:
pd.read_csv?

Even though this functions has many parameters, we will simply pass it the location of the text file. We know that we saved things into the same directory.

### CSVs and Excel

In [25]:
path = 'malaysia_states.csv'
df = pd.read_csv(path)
df

              Johor   19210
0             Kedah    9500
1          Kelantan   15099
2            Melaka    1664
3   Negeri Sembilan    6686
4            Pahang   36137
5             Perak   21035
6            Perlis     821
7            Penang    1048
8             Sabah   73631
9           Sarawak  124450
10         Selangor    8104
11       Terengganu   13035

The read_csv function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names.
To correct this we will pass the header parameter to the read_csv function and set it to None (means null in python).

In [26]:
df = pd.read_csv(path, header=None)
df

                  0       1
0             Johor   19210
1             Kedah    9500
2          Kelantan   15099
3            Melaka    1664
4   Negeri Sembilan    6686
5            Pahang   36137
6             Perak   21035
7            Perlis     821
8            Penang    1048
9             Sabah   73631
10          Sarawak  124450
11         Selangor    8104
12       Terengganu   13035

If we wanted to give the columns specific names, we would have to pass another paramter called names. We can also omit the header parameter.

In [27]:
area_df = pd.read_csv(path, names=['State','Area'])
area_df

              State    Area
0             Johor   19210
1             Kedah    9500
2          Kelantan   15099
3            Melaka    1664
4   Negeri Sembilan    6686
5            Pahang   36137
6             Perak   21035
7            Perlis     821
8            Penang    1048
9             Sabah   73631
10          Sarawak  124450
11         Selangor    8104
12       Terengganu   13035

You can think of the numbers [0,1,2,3,4] as the row numbers in an Excel file. In pandas these are part of the ***index*** of the dataframe. You can think of the index as the primary key of a sql table with the exception that an index is allowed to have duplicates.  

***[State, Area]*** can be thought of as column headers similar to the ones found in an Excel spreadsheet or sql database.

> Delete the csv file now that we are done using it.

In [28]:
# Using a Python Library - you can also use the unix command directly!
import os
os.remove(path)

In [29]:
# Note that we do the same with xls files, only use read_excel.
# Try it!
pd.read_excel?

## Selecting Data

We can select data both by their labels and by their position.

In [30]:
dates = pd.date_range('20160101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print(dates)
df

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2016-01-01 -2.242398  1.304556  1.052590 -1.131903
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057
2016-01-05 -2.508002  0.316030 -0.799921  1.216640
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294

In [31]:
# Try head, tail, index, columns, values, describe, T, sort_index
# sort_values and see for yourself what they do!
print(df.head())
print(df.tail())
print(df.index)
print(df.columns)
print(df.values)
print(df.describe)
print(df.T)
print(df.sort_index)

                   A         B         C         D
2016-01-01 -2.242398  1.304556  1.052590 -1.131903
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057
2016-01-05 -2.508002  0.316030 -0.799921  1.216640
                   A         B         C         D
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057
2016-01-05 -2.508002  0.316030 -0.799921  1.216640
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294
DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')
Index(['A', 'B', 'C', 'D'], dtype='object')
[[-2.24239766  1.30455571  1.05258987 -1.13190299]
 [ 1.43222502 -1.71375036  2.42141977 -1.26782459]
 [ 1.12713851 -1.36194248  0.00346683 -0.42171838]
 [-1.52931021 -0.20520788  1.94859183 -0.68805693]
 [-2.50800246  0.31602954 -0.79992083  1.21663977]
 [-0.86345356 -0.81593429 -0.57005639  0.61629407]]
<bound method NDFrame.describe of                    A         B         C         D
2016-01-01 -2.242398  1.304556  1.052590 -1.131903
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057
2016-01-05 -2.508002  0.316030 -0.799921  1.216640
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294>
   2016-01-01  2016-01-02  2016-01-03  2016-01-04  2016-01-05  2016-01-06
A   -2.242398    1.432225    1.127139   -1.529310   -2.508002   -0.863454
B    1.304556   -1.713750   -1.361942   -0.205208    0.316030   -0.815934
C    1.052590    2.421420    0.003467    1.948592   -0.799921   -0.570056
D   -1.131903   -1.267825   -0.421718   -0.688057    1.216640    0.616294
<bound method DataFrame.sort_index of                    A         B         C         D
2016-01-01 -2.242398  1.304556  1.052590 -1.131903
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057
2016-01-05 -2.508002  0.316030 -0.799921  1.216640
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294>

In [32]:
# Getting a cross section on a label
print((dates[0])) # First index
print((df.loc[dates[0]]))

2016-01-01 00:00:00
A   -2.242398
B    1.304556
C    1.052590
D   -1.131903
Name: 2016-01-01 00:00:00, dtype: float64

In [33]:
# Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2016-01-01 -2.242398  1.304556
2016-01-02  1.432225 -1.713750
2016-01-03  1.127139 -1.361942
2016-01-04 -1.529310 -0.205208
2016-01-05 -2.508002  0.316030
2016-01-06 -0.863454 -0.815934

In [34]:
# Showing label slicing, both endpoints are included 
# unlike normal slicing
df.loc['20160103':'20160105',['B','C']]

                   B         C
2016-01-03 -1.361942  0.003467
2016-01-04 -0.205208  1.948592
2016-01-05  0.316030 -0.799921

In [35]:
# To get a scalar value... both work!
df.loc[dates[2],'D']
# df.at[dates[2],'D']

-0.42171838187821

In [36]:
df.at[dates[2],'D']

-0.42171838187821

```iloc``` is the same as ```loc```, only it works by position, not by label.

In [37]:
# Select via the position of the passed integers
df.iloc[2,3]

-0.42171838187821

In [38]:
# By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2016-01-04 -1.529310 -0.205208
2016-01-05 -2.508002  0.316030

In [39]:
# By lists of integer position locations, 
# similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2016-01-02  1.432225  2.421420
2016-01-03  1.127139  0.003467
2016-01-05 -2.508002 -0.799921

In [40]:
# iloc is used to slice rows and columns explicitly
df.iloc[1:3,:]

                   A         B         C         D
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718

In [41]:
df.iloc[:,1:3]

                   B         C
2016-01-01  1.304556  1.052590
2016-01-02 -1.713750  2.421420
2016-01-03 -1.361942  0.003467
2016-01-04 -0.205208  1.948592
2016-01-05  0.316030 -0.799921
2016-01-06 -0.815934 -0.570056

In [42]:
# For getting a value explicitly
df.iloc[1,1]
# df.iat[1,1]

-1.7137503587437595

## Exercise

In [43]:
# retrieve the value of Column C on 2016-01-05
df.iloc[4,2]

-0.7999208312975592

In [44]:
# sort the states by area in descending order
area_df.sort_values(by= 'Area', ascending = False)

              State    Area
10          Sarawak  124450
9             Sabah   73631
5            Pahang   36137
6             Perak   21035
0             Johor   19210
2          Kelantan   15099
12       Terengganu   13035
1             Kedah    9500
11         Selangor    8104
4   Negeri Sembilan    6686
3            Melaka    1664
8            Penang    1048
7            Perlis     821

In [45]:
# which is the smallest state?
area_df.sort_values(by= 'Area', ascending = False).tail(1)

    State  Area
7  Perlis   821

### Masks

We can use _boolean arrays_ to select data

In [46]:
df.A>0

2016-01-01    False
2016-01-02     True
2016-01-03     True
2016-01-04    False
2016-01-05    False
2016-01-06    False
Freq: D, Name: A, dtype: bool

In [47]:
df[df.A > 0] # We added a row condition

                   A         B         C         D
2016-01-02  1.432225 -1.713750  2.421420 -1.267825
2016-01-03  1.127139 -1.361942  0.003467 -0.421718

In [48]:
df > 0 # Applied on all condition

                A      B      C      D
2016-01-01  False   True   True  False
2016-01-02   True  False   True  False
2016-01-03   True  False   True  False
2016-01-04  False  False   True  False
2016-01-05  False   True  False   True
2016-01-06  False  False  False   True

In [49]:
df[df > 0]

                   A         B         C         D
2016-01-01       NaN  1.304556  1.052590       NaN
2016-01-02  1.432225       NaN  2.421420       NaN
2016-01-03  1.127139       NaN  0.003467       NaN
2016-01-04       NaN       NaN  1.948592       NaN
2016-01-05       NaN  0.316030       NaN  1.216640
2016-01-06       NaN       NaN       NaN  0.616294

### Setting Data

In [50]:
df['E'] = ['one', 'one','two','three','four','three']
df

                   A         B         C         D      E
2016-01-01 -2.242398  1.304556  1.052590 -1.131903    one
2016-01-02  1.432225 -1.713750  2.421420 -1.267825    one
2016-01-03  1.127139 -1.361942  0.003467 -0.421718    two
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057  three
2016-01-05 -2.508002  0.316030 -0.799921  1.216640   four
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294  three

In [51]:
df['E'].isin(['two','four'])

2016-01-01    False
2016-01-02    False
2016-01-03     True
2016-01-04    False
2016-01-05     True
2016-01-06    False
Freq: D, Name: E, dtype: bool

In [52]:
df[df['E'].isin(['two','four'])]

                   A         B         C         D     E
2016-01-03  1.127139 -1.361942  0.003467 -0.421718   two
2016-01-05 -2.508002  0.316030 -0.799921  1.216640  four

In [53]:
# We can set data in a variety of ways
print(df)
df.at[dates[0],'A'] = 0
df.iat[0,1] = 0
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C         D      E
2016-01-01 -2.242398  1.304556  1.052590 -1.131903    one
2016-01-02  1.432225 -1.713750  2.421420 -1.267825    one
2016-01-03  1.127139 -1.361942  0.003467 -0.421718    two
2016-01-04 -1.529310 -0.205208  1.948592 -0.688057  three
2016-01-05 -2.508002  0.316030 -0.799921  1.216640   four
2016-01-06 -0.863454 -0.815934 -0.570056  0.616294  three

                   A         B         C  D      E
2016-01-01  0.000000  0.000000  1.052590  5    one
2016-01-02  1.432225 -1.713750  2.421420  5    one
2016-01-03  1.127139 -1.361942  0.003467  5    two
2016-01-04 -1.529310 -0.205208  1.948592  5  three
2016-01-05 -2.508002  0.316030 -0.799921  5   four
2016-01-06 -0.863454 -0.815934 -0.570056  5  three

## Exercise

In [54]:
# Rename the column E to 'values'
df.rename(columns = {'E':'values'}, inplace = True)
df

                   A         B         C  D values
2016-01-01  0.000000  0.000000  1.052590  5    one
2016-01-02  1.432225 -1.713750  2.421420  5    one
2016-01-03  1.127139 -1.361942  0.003467  5    two
2016-01-04 -1.529310 -0.205208  1.948592  5  three
2016-01-05 -2.508002  0.316030 -0.799921  5   four
2016-01-06 -0.863454 -0.815934 -0.570056  5  three

In [55]:
# Add another new column to df (name of the column is 'total')
# Add the values of A, B and C and state the total values in 'total' column
df['Total'] = list(np.zeros(6))

# df
df

                   A         B         C  D values  Total
2016-01-01  0.000000  0.000000  1.052590  5    one    0.0
2016-01-02  1.432225 -1.713750  2.421420  5    one    0.0
2016-01-03  1.127139 -1.361942  0.003467  5    two    0.0
2016-01-04 -1.529310 -0.205208  1.948592  5  three    0.0
2016-01-05 -2.508002  0.316030 -0.799921  5   four    0.0
2016-01-06 -0.863454 -0.815934 -0.570056  5  three    0.0

In [56]:
# Add the values of A, B and C and state the total values in 'total' column
df.loc[:,'Total'] = df.iloc[:,1:3].sum(axis=1)
df

                   A         B         C  D values     Total
2016-01-01  0.000000  0.000000  1.052590  5    one  1.052590
2016-01-02  1.432225 -1.713750  2.421420  5    one  0.707669
2016-01-03  1.127139 -1.361942  0.003467  5    two -1.358476
2016-01-04 -1.529310 -0.205208  1.948592  5  three  1.743384
2016-01-05 -2.508002  0.316030 -0.799921  5   four -0.483891
2016-01-06 -0.863454 -0.815934 -0.570056  5  three -1.385991

In [57]:
# Export the data in df to a csv file.
df.to_csv('final_df.csv',index=True,header=True)

In [58]:
### 
# #Total sum per column: 
# df.loc['Total',:]= df.sum(axis=0)

# #Total sum per row: 
# df.loc[:,'Total'] = df.sum(axis=1)